ldc_set_location -site {F16} [get_ports ftdi_tx]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports ftdi_tx]
ldc_set_location -site {F18} [get_ports ftdi_rx]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33} [get_ports ftdi_rx]

## I/O delay constraints
create_clock -period 20.000 -name clk1 -waveform {0.000 10.000}

set_input_delay  -clock clk1 -max 50.000  [get_ports ftdi_tx]
set_input_delay  -clock clk1 -min 20.000  [get_ports ftdi_tx]
set_output_delay -clock clk1 -max 50.000  [get_ports ftdi_rx]
set_output_delay -clock clk1 -min 20.000  [get_ports ftdi_rx]
set_input_delay  -clock clk1 -max 100.000 [get_ports resetn]
set_input_delay  -clock clk1 -min 50.000  [get_ports resetn]

## it doesn't actually matter
set_false_path -through [get_ports ftdi_tx]
set_false_path -through [get_ports ftdi_rx]
set_false_path -through [get_ports resetn]

create_clock -period 10.000 -name jtag_tck [get_nets jtag_tck]

set_false_path -through [get_ports jtag_tck]

set_input_delay -clock jtag_tck -max 10.00 [get_ports tdo]
set_input_delay -clock jtag_tck -min 5.00 [get_ports tdo]
set_output_delay -clock jtag_tck -max 10.00 [get_ports tdi]
set_output_delay -clock jtag_tck -min 5.00 [get_ports tdi]
set_output_delay -clock jtag_tck -max 10.00 [get_ports tms]
set_output_delay -clock jtag_tck -min 5.00 [get_ports tms]

# MURAX
# ldc_set_location -site {J2} [get_ports tck]
# ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tck]
# ldc_set_location -site {J1} [get_ports tms]
# ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tms]
# ldc_set_location -site {K2} [get_ports tdi]
# ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tdi]
# ldc_set_location -site {K1} [get_ports tdo]
# ldc_set_port -iobuf {IO_TYPE=LVCMOS33} [get_ports tdo]

## PMOD2
##1, 2, 4, 8
ldc_set_location -site {J2} [get_ports tck]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tck]
ldc_set_location -site {J1} [get_ports tdo]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33} [get_ports tdo]
ldc_set_location -site {K1} [get_ports tms]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tms]
ldc_set_location -site {K4} [get_ports tdi]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports tdi]

ldc_set_location -site {E8} [get_ports spi_sclk]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports spi_sclk]
ldc_set_location -site {E7} [get_ports spi_miso]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports spi_miso]
ldc_set_location -site {E9} [get_ports spi_mosi]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33} [get_ports spi_mosi]
ldc_set_location -site {E10} [get_ports spi_csn]
ldc_set_port -iobuf {IO_TYPE=LVCMOS33 PULLMODE=NONE} [get_ports spi_csn]
